2019/javaee-servlet-summary.html
<!DOCTYPE html>
<html lang="zh-CN">
<head>
<!-- 2021-03-07 周日 15:56 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>Java EE - Servlet 小结</title>
<meta name="generator" content="Org mode">
<meta name="author" content="rgb-24bit">
<link rel="stylesheet" type="text/css" href="https://rgb-24bit.github.io/blog/misc/style.css">
<!-- Global site tag (gtag.js) - Google Analytics -->
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="https://rgb-24bit.github.io/blog/"> UP </a>
 |
 <a accesskey="H" href="https://rgb-24bit.github.io"> HOME </a>
</div><div id="content">
<h1 class="title">Java EE - Servlet 小结</h1>
<div id="table-of-contents">
<h2>&#30446;&#24405;</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org4788d6e">1. 前言</a></li>
<li><a href="#org81bd3af">2. Servlet 的生命周期</a></li>
<li><a href="#org264ec75">3. Servlet 的初始化</a>
<ul>
<li><a href="#orgbc149b8">3.1. ServletContext &amp; ServletConfig</a></li>
</ul>
</li>
<li><a href="#orgf07f485">4. 请求的处理</a>
<ul>
<li><a href="#orgf4524e8">4.1. HttpServletRequest</a></li>
<li><a href="#org7e262b5">4.2. 请求分派</a></li>
<li><a href="#orgebdff9f">4.3. 属性</a></li>
<li><a href="#org5907924">4.4. HttpServletResponse</a></li>
</ul>
</li>
<li><a href="#org2d46b09">5. Servlet 的销毁</a></li>
<li><a href="#org873b9f2">6. 监听者和过滤器</a></li>
<li><a href="#orgfb06d41">7. 完整生命周期和默认 Servlet</a></li>
<li><a href="#orgdae28f5">8. 结语</a></li>
</ul>
</div>
</div>

<div id="outline-container-org4788d6e" class="outline-2">
<h2 id="org4788d6e"><span class="section-number-2">1</span> 前言</h2>
<div class="outline-text-2" id="text-1">
<p>
最近在看《Spring in Action(4th Edition)》的过程中发现，使用 Spring MVC 进行 Web 开发时，原生 Servlet 的存在感已经低到了一定程度。
</p>

<p>
我感觉在不总结一下的话，要不了多久，学过的关于 Servlet 的知识就要忘完了……
</p>

<p>
注：由于学习 Servlet 使用的教材《Head First Servlet &amp; JSP》属于一本比较老的书，和现在基本上都是 Servlet 3.1 及以上的情况不一样，它使用的大概是 Servlet 2.5，因此，有一些高版本的新特性估计不会在本篇博客中出现 (-_-)
</p>
</div>
</div>

<div id="outline-container-org81bd3af" class="outline-2">
<h2 id="org81bd3af"><span class="section-number-2">2</span> Servlet 的生命周期</h2>
<div class="outline-text-2" id="text-2">
<p>
Servlet 的生命周期大概可以分为三个阶段：
</p>
<ol class="org-ol">
<li>第一个阶段是 Servlet 类的加载与初始化，在这一阶段 Servlet 容器会执行如下操作：
<ol class="org-ol">
<li>加载 Servlet 类</li>
<li>创建 Servlet 实例</li>
<li>调用 Servlet 的 <code>init</code> 方法，将 <code>ServletContext</code> 和 <code>ServletConfig</code> 对象传递给 Servlet</li>
</ol></li>
<li>第二个阶段是 Servlet 实例处理请求的阶段，在这个阶段 Servlet 实例将会存活在内存中，每当一个请求到达时，便会在一个 <b>新的线程</b> 中执行该 Servlet 的 <code>service</code> 方法处理请求</li>
<li>第三个阶段就是 Servlet 实例去世的阶段，在 Servlet 实例被销毁之前会调用该实例的 <code>destroy</code> 方法</li>
</ol>

<p>
通过观察 Servlet 的生命周期可以发现，容器并不是为每一个请求都分配一个 Servlet 实例，而是为每个请求分配一个线程，单个 Servlet 的实例只会存在一个。
</p>

<p>
因此，假如需要操作 Servlet 的实例域，那么就需要注意 <b>线程安全</b> 的问题。
</p>
</div>
</div>

<div id="outline-container-org264ec75" class="outline-2">
<h2 id="org264ec75"><span class="section-number-2">3</span> Servlet 的初始化</h2>
<div class="outline-text-2" id="text-3">
<p>
Servlet 类的加载和初始化是由容器完成的，默认情况下这一过程是在第一个请求来临时进行的，这就意味着第一个发出相应请求的客户需要多等一会儿了。
</p>

<p>
但是我们也可以在 DD 添加一点配置使得 Servlet 在应用部署（服务器启动）时完成加载与初始化：
</p>
<div class="org-src-container">
<pre class="src src-xml"><span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-element-local-name">servlet</span><span class="org-nxml-tag-delimiter">&gt;</span>
  <span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-element-local-name">load-on-startup</span><span class="org-nxml-tag-delimiter">&gt;</span><span class="org-nxml-text">1</span><span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-tag-slash">/</span><span class="org-nxml-element-local-name">load-on-startup</span><span class="org-nxml-tag-delimiter">&gt;</span>
<span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-tag-slash">/</span><span class="org-nxml-element-local-name">servlet</span><span class="org-nxml-tag-delimiter">&gt;</span>
</pre>
</div>

<p>
只要 <code>load-on-startup</code> 的值不为负，相应的 <code>Servlet</code> 便会在应用部署（服务器启动）时完成加载与初始化，同时，不同的 Servlet 的加载顺序将由 <code>load-on-startup</code> 的值的大小确定。
</p>

<p>
我们可以决定 Servlet 的加载与初始化时间，同时也可以通过覆盖无参的 <code>init</code> 方法配置 Servlet 初始化时要做的一些事：
</p>
<div class="org-src-container">
<pre class="src src-java"><span class="org-keyword">public</span> <span class="org-keyword">class</span> <span class="org-type">MyServlet</span> <span class="org-keyword">extends</span> <span class="org-type">HttpServlet</span> {
  <span class="org-keyword">public</span> <span class="org-type">void</span> <span class="org-function-name">init</span>() <span class="org-keyword">throws</span> <span class="org-type">ServletException</span> {
    <span class="org-comment-delimiter">// </span><span class="org-comment">write your code</span>
  }
}
</pre>
</div>

<p>
我们不应该覆盖有参的 <code>init</code> 方法，因为这并没有多大的意义，因为有参的 <code>init</code> 方法大概是这样的：
</p>
<div class="org-src-container">
<pre class="src src-java"><span class="org-keyword">public</span> <span class="org-type">void</span> <span class="org-function-name">init</span>(<span class="org-type">ServletConfig</span> <span class="org-variable-name">config</span>) <span class="org-keyword">throws</span> <span class="org-type">ServletException</span> {
  <span class="org-keyword">this</span>.config = config;
  <span class="org-keyword">this</span>.init();
}
</pre>
</div>

<p>
可以看到，有参的 <code>init</code> 方法的参数是一个 <code>ServletConfig</code> 对象（它包含 <code>ServletContext</code> 对象的引用），它会调用无参的 <code>init</code> 方法。
</p>

<p>
因此，覆盖无参的 <code>init</code> 方法就足够我们使用了。
</p>
</div>

<div id="outline-container-orgbc149b8" class="outline-3">
<h3 id="orgbc149b8"><span class="section-number-3">3.1</span> ServletContext &amp; ServletConfig</h3>
<div class="outline-text-3" id="text-3-1">
<p>
在容器调用 <code>Servlet</code> 的 <code>init</code> 方法时，会将该 <code>Servlet</code> 的 <code>ServletConfig</code> 对象传递给它，我们可以通过 <code>ServletConfig</code> 对象获得为该 <code>Servlet</code> 配置的初始化参数：
</p>
<div class="org-src-container">
<pre class="src src-java">ServletConfig.getInitParameter(<span class="org-type">String</span> <span class="org-variable-name">name</span>);
</pre>
</div>

<p>
初始化参数只能获取不能设置，因此只有 <code>getInitParameter</code> 方法没有 <code>setInitParameter</code> 方法！
</p>

<p>
Servlet 的初始化参数是通过 DD 文件进行配置的：
</p>
<div class="org-src-container">
<pre class="src src-xml"><span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-element-local-name">servlet</span><span class="org-nxml-tag-delimiter">&gt;</span>
  <span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-element-local-name">init-param</span><span class="org-nxml-tag-delimiter">&gt;</span>
    <span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-element-local-name">param-name</span><span class="org-nxml-tag-delimiter">&gt;</span><span class="org-nxml-text">name</span><span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-tag-slash">/</span><span class="org-nxml-element-local-name">param-name</span><span class="org-nxml-tag-delimiter">&gt;</span>
    <span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-element-local-name">param-value</span><span class="org-nxml-tag-delimiter">&gt;</span><span class="org-nxml-text">value</span><span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-tag-slash">/</span><span class="org-nxml-element-local-name">param-value</span><span class="org-nxml-tag-delimiter">&gt;</span>
  <span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-tag-slash">/</span><span class="org-nxml-element-local-name">init-param</span><span class="org-nxml-tag-delimiter">&gt;</span>
<span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-tag-slash">/</span><span class="org-nxml-element-local-name">servlet</span><span class="org-nxml-tag-delimiter">&gt;</span>
</pre>
</div>

<p>
除了获取初始化参数以外，ServletConfig 的另一个重要作用便是获取 <code>ServletContext</code> 对象：
</p>
<div class="org-src-container">
<pre class="src src-java">ServletConfig.getServletContext();
</pre>
</div>

<p>
ServletContext 的功能就比 ServletConfig 强大多了，除了初始化参数以外，还可以设置属性、获取应用程序的相关信息、输出日志、分派请求……
</p>

<p>
这里可以来看一下初始化参数，获取方式和 ServletConfig 一样：
</p>
<div class="org-src-container">
<pre class="src src-java">ServletContext.getInitParameter(<span class="org-type">String</span> <span class="org-variable-name">name</span>);
</pre>
</div>

<p>
配置上也差不多：
</p>
<div class="org-src-container">
<pre class="src src-xml"><span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-element-local-name">web-app</span><span class="org-nxml-tag-delimiter">&gt;</span>
  <span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-element-local-name">context-param</span><span class="org-nxml-tag-delimiter">&gt;</span>
    <span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-element-local-name">param-name</span><span class="org-nxml-tag-delimiter">&gt;</span><span class="org-nxml-text">name</span><span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-tag-slash">/</span><span class="org-nxml-element-local-name">param-name</span><span class="org-nxml-tag-delimiter">&gt;</span>
    <span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-element-local-name">param-value</span><span class="org-nxml-tag-delimiter">&gt;</span><span class="org-nxml-text">value</span><span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-tag-slash">/</span><span class="org-nxml-element-local-name">param-value</span><span class="org-nxml-tag-delimiter">&gt;</span>
  <span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-tag-slash">/</span><span class="org-nxml-element-local-name">context-param</span><span class="org-nxml-tag-delimiter">&gt;</span>
<span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-tag-slash">/</span><span class="org-nxml-element-local-name">web-app</span><span class="org-nxml-tag-delimiter">&gt;</span>
</pre>
</div>

<p>
需要注意的是：ServletConfig 是每个 Servlet 都有的，但是 ServletContext 整个应用程序只存在一个（分布式除外）。
</p>
</div>
</div>
</div>

<div id="outline-container-orgf07f485" class="outline-2">
<h2 id="orgf07f485"><span class="section-number-2">4</span> 请求的处理</h2>
<div class="outline-text-2" id="text-4">
<p>
请求的处理是在 Servlet 的 <code>service</code> 方法中完成的，而我们经常使用的 <code>HttpServlet</code> 的 <code>service</code> 方法会根据请求使用的 HTTP 方法调用 doGet、doPost 等方法。
</p>

<p>
虽然说是处理请求，但其实我们也需要负责将响应内容写入响应对象，不过还好的是，我们一般不需要要手动将 HTML 写入响应 @_@
</p>
</div>

<div id="outline-container-orgf4524e8" class="outline-3">
<h3 id="orgf4524e8"><span class="section-number-3">4.1</span> HttpServletRequest</h3>
<div class="outline-text-3" id="text-4-1">
<p>
处理请求的过程其实就是获取客户端的信息，然后根据信息判断返回给客户端什么东西的过程。
</p>

<p>
一般情况下，我们会先对客户端的状态进行判断，由于 HTTP 协议是无状态协议，因此判断客户端状态的常用方式是通过 <code>Cookie</code> 和 <code>Session</code>.
</p>

<p>
这两个都可以通过 <code>HttpServletRequest</code> 对象获得：
</p>
<div class="org-src-container">
<pre class="src src-java">HttpservletRequest.getCookies();
HttpservletRequest.getSession();
</pre>
</div>

<p>
至于 Session 和 Cookie 的使用，单独拿出来都可以写一篇博客了，这里就不多说了 (´• ω •`)
</p>

<p>
如果你有编写爬虫的经历的话，你就应该知道，客户端发送的信息除了 Cookie 以外还可能有请求头、请求参数和资源。
</p>

<p>
这些都可以通过 <code>HttpServletRequest</code> 对象获取：
</p>
<div class="org-src-container">
<pre class="src src-java">HttpservletRequest.getHeader(<span class="org-type">String</span>);
HttpservletRequest.getParameter(String);
HttpservletRequest.getInputStream();
</pre>
</div>

<p>
和 Session 与 Cookie 一样，更详细的使用请自己进行探索 (￣▽￣*)ゞ
</p>
</div>
</div>

<div id="outline-container-org7e262b5" class="outline-3">
<h3 id="org7e262b5"><span class="section-number-3">4.2</span> 请求分派</h3>
<div class="outline-text-3" id="text-4-2">
<p>
<code>HttpServletRequest</code> 对象除了获取客户端的信息以外，还有一个重要的功能便是进行 <b>请求分派</b>, 比如说这样：
</p>
<div class="org-src-container">
<pre class="src src-java"><span class="org-keyword">protected</span> <span class="org-type">void</span> <span class="org-function-name">doGet</span>(<span class="org-type">HttpServletRequest</span> <span class="org-variable-name">req</span>, <span class="org-type">HttpServletResponse</span> <span class="org-variable-name">resp</span>) <span class="org-keyword">throws</span> <span class="org-type">ServletException</span>, <span class="org-type">IOException</span> {
  <span class="org-comment-delimiter">// </span><span class="org-comment">&#33719;&#21462;&#35831;&#27714;&#20998;&#27966;&#22120;</span>
  <span class="org-type">RequestDispatcher</span> <span class="org-variable-name">dispatcher</span> = req.getRequestDispatcher(<span class="org-string">"view.jsp"</span>);

  <span class="org-comment-delimiter">// </span><span class="org-comment">&#36827;&#34892;&#35831;&#27714;&#20998;&#27966;</span>
  dispatcher.forward(req, resp);
}
</pre>
</div>

<p>
请求分派可以通过 <code>HttpServletRequest</code> 对象完成，但是也可以通过 <code>ServletContext</code> 对象进行，两者的区别并不大，主要区别在于获取 <code>RequestDispatcher</code> 对象时可以使用的参数：
</p>
<ul class="org-ul">
<li>HttpServletRequest 的 <code>getRequestDispatcher</code> 方法支持相对与绝对路径</li>
<li>ServletContext 的 <code>getRequestDispatcher</code> 方法仅支持绝对路径</li>
</ul>

<p>
进行请求分派时可以选择的操作有：
</p>
<ul class="org-ul">
<li><code>forward</code> - 将请求的处理彻底交给其他组件了，自己不再管</li>
<li><code>include</code> - 让其他组件处理一下请求，处理完了还是要将控制权还给自己</li>
</ul>
</div>
</div>

<div id="outline-container-orgebdff9f" class="outline-3">
<h3 id="orgebdff9f"><span class="section-number-3">4.3</span> 属性</h3>
<div class="outline-text-3" id="text-4-3">
<p>
通过请求分派，我们可以通过多个组件完成一个请求的处理，将视图渲染和业务逻辑分开。而属性，便是联系这些不同的组件的桥梁。
</p>

<p>
在 Servlet 中，可以设置属性的对象有三个，分别为：ServletRequest、ServletContext、Session。
</p>

<p>
属性的使用方式都是一样的，通过 <code>getAttribute/setAttribute</code> 方法获取设置属性，通过 <code>removeAttribute</code> 移除属性。
</p>

<p>
我们需要注意的应该是使用哪个对象的属性：
</p>
<ul class="org-ul">
<li>ServletRequest - 我们可以将和 <b>单个请求</b> 相关的属性存储在请求对象中，处理同一个请求的不同组件可以通过这些属性进行交流</li>
<li>Session - 我们应该将和 <b>单个客户</b> 相关的属性存储在 Session 对象中，通过 Session 对象的属性我们可以跟踪客户的状态</li>
<li>ServletContext - 我们一个将用于整个应用的属性存储在 ServletContext 对象中</li>
</ul>

<p>
注：这三个对象中，只有 <code>ServletRequest</code> 的属性是线程安全的。
</p>
</div>
</div>

<div id="outline-container-org5907924" class="outline-3">
<h3 id="org5907924"><span class="section-number-3">4.4</span> HttpServletResponse</h3>
<div class="outline-text-3" id="text-4-4">
<p>
处理完请求之后便需要将响应内容写入响应对象了，这个过程中我们需要写入的内容包括：响应状态码、响应头、响应体。
</p>

<p>
通常情况下，响应状态码不需要我们设置，直接使用默认的就可以了。如果需要设置的话可以通过 <code>HttpServletResponse</code> 对象的 <code>setStatus</code> 方法设置。
</p>

<p>
响应头可以通过 <code>addHeader</code> 添加，同时还可以通过 <code>addCookie</code> 方法快捷的添加 Cookie。
</p>

<p>
可以通过 <code>getOutputStream/getWriter</code> 方法获取写入响应体内容的输出流。
</p>

<p>
可以看到，响应的使用还是比较简单的，基本上就是 HTTP 协议响应的简单抽象。
</p>

<p>
另外，如果需要进行重定向的话，可以通过 <code>HttpServletResponse</code> 对象的 <code>sendRedirect</code> 方法，这个方法支持相对路径。
</p>

<p>
这里需要注意请求分派与重定向之间的区别：
</p>
<ul class="org-ul">
<li>请求分派在服务器内部完成，客户端只需要发起一次请求</li>
<li>重定向有客户端完成，客户端需要发起两次请求</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org2d46b09" class="outline-2">
<h2 id="org2d46b09"><span class="section-number-2">5</span> Servlet 的销毁</h2>
<div class="outline-text-2" id="text-5">
<p>
Servlet 被销毁之前会调用 <code>destroy</code> 方法，但是这个方法我目前还没有用过 (￢_￢)
</p>

<p>
教材上也只是简单的提了一下有这么个阶段，所以，我也提一下 (￣▽￣)ノ
</p>
</div>
</div>

<div id="outline-container-org873b9f2" class="outline-2">
<h2 id="org873b9f2"><span class="section-number-2">6</span> 监听者和过滤器</h2>
<div class="outline-text-2" id="text-6">
<p>
监听者和过滤器不是 Servlet，但却是和 Servlet 密切相关的两个东西，因此便放到这篇博客里面了。
</p>

<p>
监听者可以监听和应用程序内部的关键时刻相关的事件，包括：
</p>
<ul class="org-ul">
<li>上下文的初始化与销毁</li>
<li>上下文属性的设置</li>
<li>请求的初始化与销毁</li>
<li>请求属性的设置</li>
<li>Session 的创建与销毁</li>
<li>Session 属性的设置与绑定</li>
<li>Session 的迁移（针对分布式 Session）</li>
</ul>

<p>
通过监听这些事件我们可以在不干涉请求处理流程的情况下进行一些额外的操作，比如我们可以在上下文初始化的时候建立和数据库的连接，在上下文销毁的时候断开和数据库的连接。
</p>

<p>
大多数监听者都需要在 DD 文件中注册（除了 HttpSessionBindingListener）：
</p>
<div class="org-src-container">
<pre class="src src-xml"><span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-element-local-name">web-app</span><span class="org-nxml-tag-delimiter">&gt;</span>
  <span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-element-local-name">listener</span><span class="org-nxml-tag-delimiter">&gt;</span>
    <span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-element-local-name">listener-class</span><span class="org-nxml-tag-delimiter">&gt;</span><span class="org-nxml-text">package.className</span><span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-tag-slash">/</span><span class="org-nxml-element-local-name">listener-class</span><span class="org-nxml-tag-delimiter">&gt;</span>
  <span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-tag-slash">/</span><span class="org-nxml-element-local-name">listener</span><span class="org-nxml-tag-delimiter">&gt;</span>
<span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-tag-slash">/</span><span class="org-nxml-element-local-name">web-app</span><span class="org-nxml-tag-delimiter">&gt;</span>
</pre>
</div>

<p>
而过滤器，可以对请求和响应进行额外的操作，使用过滤器时，容器会将所有匹配的过滤器和 Servlet 连成一条链，然后按照过滤器（1、2、3……） -&gt; Servlet -&gt; 过滤器（……3、2、1）的顺序对请求和响应进行处理。其中过滤器的顺序是按照它们在 DD 文件中的声明顺序排列的（教材上这个地方有问题，还是我自己查资料尝试确认的 (；￣Д￣)）
</p>

<p>
如果中途过滤器拦截了请求或将请求转发，那么这个链条后面的成员可能就收不到请求和响应了。
</p>

<p>
和前面一样，详细内容请自己探索 &lt;・ )))&gt;&lt;&lt;
</p>
</div>
</div>

<div id="outline-container-orgfb06d41" class="outline-2">
<h2 id="orgfb06d41"><span class="section-number-2">7</span> 完整生命周期和默认 Servlet</h2>
<div class="outline-text-2" id="text-7">
<p>
之前介绍了一下 Servlet 的生命周期，这里的是加上容器的生命周期：
</p>
<ol class="org-ol">
<li>服务器启动</li>
<li>容器启动
<ul class="org-ul">
<li>容器根据 DD 文件中的内容创建 ServletContext</li>
</ul></li>
<li>当客户端发起请求时，服务器将请求转发给容器</li>
<li>容器根据请求创建 Servlet 实例
<ul class="org-ul">
<li>容器根据 DD 文件中的内容创建 ServletConfig</li>
</ul></li>
<li>容器创建和请求相对应的 request 和 respone 对象，并将这两个对象交给 Servlet 处理</li>
<li>容器将处理好的响应返回给服务器</li>
<li>服务器将响应转发给客服端</li>
</ol>

<p>
这里需要注意的是容器和服务器不是一个东西，我们常用的 apache-tomcat 其实是 apache 服务器 + tomcat 服务器。
</p>

<p>
虽然 tomcat 也自带服务器，但是那个东西的功能用来测试还可以，要是放到生产环境就不够用了，因此便需要一个专业的服务器来辅助，比如 apache。
</p>

<p>
然后是默认 Servlet，在学习了生命周期后我就一直在思考：既然请求都是交给 Servlet 处理的，那么静态资源呢？我并没有给它们配置 Servlet 啊！
</p>

<p>
后来我才了解到，是有默认 Servlet 存在的，对静态资源的请求都是通过默认 Servlet 进行处理的，还有 JSP 也是……
</p>

<p>
当时就打开了新世界的大门 ＼(￣▽￣)／
</p>

<p>
详细内容可以参考 <a href="https://tomcat.apache.org/tomcat-7.0-doc/default-servlet.html">Apache Tomcat 7 (7.0.94) - Default Servlet Reference</a>
</p>
</div>
</div>

<div id="outline-container-orgdae28f5" class="outline-2">
<h2 id="orgdae28f5"><span class="section-number-2">8</span> 结语</h2>
<div class="outline-text-2" id="text-8">
<p>
和往常一样，这篇博客里面没有多少使用上的细节，emmm，连 Servlet 映射的配置都没有 @_@
</p>

<p>
但是不得不说，Servlet 接口的设计是很漂亮的，可以让人感受到一种美感！
</p>

<p>
当然了，现在常用的是 Spring 框架，和 Servlet 相关的一堆细节都被屏蔽了，还引入了自己的生命周期 ( ╯°□°)╯ ┻━━┻
</p>

<p>
……
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
版权声明：本作品采用<a rel="license" href="http://creativecommons.org/licenses/by-nc/4.0/">知识共享署名-非商业性使用 4.0 国际许可协议</a>进行许可
<script src="https://utteranc.es/client.js"
        repo="rgb-24bit/blog"
        issue-term="pathname"
        theme="boxy-light"
        crossorigin="anonymous"
        async>
</script>
</div>
</body>
</html>
